Tekla Open API Reference for Tekla Structures 2025
Object.Identifier Property
 The identifier of the object.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Identifier Identifier { get; set; }
Public Property Identifier As Identifier
	Get
	Set
Property Value
Type: Identifier
See Also
Reference
Object Class
Tekla.Structures.Model Namespace